<template>
  <header>
    <nav class="navbar navbar-expand-lg navbar-light bg-light">
      <a href="#" class="py-2">
        <svg
          class="icon"
          style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="1613"
        >
          <path
            d="M897.7 1024H126.3C56.9 1024 0 967.2 0 897.7V126.3C0 56.9 56.7 0 126.3 0h771.5c69.4 0 126.3 56.8 126.3 126.3v771.5c-0.1 69.4-56.9 126.2-126.4 126.2z"
            fill="#231815"
            p-id="1614"
          />
          <path
            d="M787.8 371.7c-6.7 0-13.3 1-19.7 3-26.7-50.1-62.9-77.5-102.6-77.5-17.8 0-34.8 5.5-50.9 16.3-13.1-15.4-27.2-27.1-42.4-34.7-0.3-4.9-0.4-9.8-0.4-14.7 0-49.9 7-66.7 22.7-85.3 8.4-10 10.2-23.5 4.7-35.3-5.5-11.8-17.1-19.2-30.1-19.2H541c-66.8 0-66.8 84.2-66.8 139.9 0 6.8 0.2 13.7 0.7 20.8-12.4 8-24 18.8-34.8 32.1-17.4-13-36.5-19.8-55.8-19.8-39.3 0-75.3 27-101.9 76.2-4.9-1.1-9.9-1.7-14.9-1.7-61.5 0-107.9 84.1-107.9 195.6S206 763 267.5 763c5 0 10-0.6 14.9-1.7 26.7 49.3 62.6 76.2 101.9 76.2 19.3 0 38.4-6.8 55.8-19.8 25.8 32.1 56.3 49 88.7 49 31.2 0 60.7-15.7 85.9-45.5 16.1 10.9 33.2 16.3 50.9 16.3 39.7 0 75.9-27.4 102.6-77.5 6.5 2 13.1 3 19.7 3 61.5 0 107.8-84.1 107.8-195.6s-46.4-195.7-107.9-195.7z m0 346.6c-3.6 0-7.1-0.9-10.9-2.8-7.8-4-17.1-4.7-25.3-1.9-8.1 2.8-14.6 8.5-18.3 16.2-19.1 40-43.8 63-67.9 63-10.8 0-21.8-4.6-32.6-13.7-6.7-5.7-15.6-8.4-24.4-7.3-8.7 1-16.6 5.6-21.7 12.6-12.7 17.2-33 37.6-58.1 37.6-26.3 0-47.4-22.3-60.5-41.1-5.3-7.6-13.6-12.4-22.7-13.4-1.1-0.1-2.2-0.2-3.3-0.2-8.1 0-15.9 3.1-21.9 8.7-11.9 11.1-24 16.8-36.1 16.8-23.6 0-47.9-22.2-66.9-60.9-7.4-15.2-25.6-22-41.2-15.5-3 1.2-5.8 1.8-8.7 1.8-29.9 0-63.3-64.6-63.3-151.1S237.4 416 267.3 416c2.9 0 5.8 0.6 8.7 1.8 15.7 6.5 33.8-0.3 41.2-15.5 18.9-38.7 43.3-60.8 66.9-60.8 12 0 24.2 5.6 36 16.8 6.8 6.4 15.9 9.4 25.2 8.5 9.2-1 17.5-5.8 22.7-13.4 12.1-17.3 25.8-29.8 39.4-36.1l14.6-6.8-1.9-16c-1.2-10.4-1.8-20.7-1.8-30.6 0-83.8 10.7-95.3 22.3-95.3h6c-14.4 24-19.7 51.2-19.7 95.3 0 10.7 0.6 21.5 1.7 32.2l1.5 14.3 13.6 4.5c14.7 4.9 29.5 17 42.8 35 5.1 7 13.1 11.6 21.7 12.6 8.8 1.1 17.7-1.6 24.4-7.3 10.8-9.1 21.7-13.7 32.6-13.7 24 0 48.8 23 67.9 63 3.7 7.7 10.2 13.5 18.3 16.2 8.2 2.8 17.5 2.1 25.3-1.9 3.7-1.9 7.3-2.8 10.8-2.8 29.9 0 63.3 64.6 63.3 151.1 0.3 86.6-33.1 151.2-63 151.2z"
            fill="#FFE255"
            p-id="1615"
          />
          <path
            d="M380.3 558.8c40.9 25.5 94.7 13.1 120.2-27.8l-148-92.4c-25.5 40.8-13.1 94.7 27.8 120.2zM553.2 531c25.5 40.9 79.3 53.3 120.2 27.8 40.9-25.5 53.3-79.3 27.8-120.2l-148 92.4zM669 617.9c-2.8 3.3-6 6.5-9.5 9.6l-13.6-14.8c-8.3-9.1-22.4-9.7-31.5-1.4-9.1 8.3-9.7 22.4-1.4 31.5l7.4 8.1c-12 4.9-25.4 8.9-39.5 11.7l-4.4-10.7c-4.7-11.4-17.7-16.8-29.1-12.1-11 4.5-16.3 16.8-12.5 27.9-2.4 0.1-4.8 0.1-7.2 0.1-7.8 0-15.6-0.3-23.2-1 3.3-10.9-2-22.6-12.7-27-11.4-4.7-24.4 0.7-29.1 12.1l-2.9 7.2c-13.1-3.5-25.3-8.1-36.2-13.4l2.6-2.8c8.3-9.1 7.7-23.2-1.4-31.5s-23.2-7.7-31.5 1.4l-5.8 6.3c-1.3-1.6-2.7-3.1-3.9-4.7-7.2-9.9-21.2-12.1-31.1-4.9-9.9 7.3-12.1 21.2-4.9 31.1 2.9 3.9 6.2 7.7 9.7 11.4l-8.6 9.4c-8.3 9.1-7.7 23.2 1.4 31.5 4.3 3.9 9.7 5.8 15 5.8 6 0 12-2.4 16.4-7.2l11.1-12.1c14.8 8.6 31.7 15.7 50 21.1l-5.1 12.4c-4.7 11.4 0.8 24.4 12.1 29.1 2.8 1.1 5.6 1.7 8.5 1.7 8.8 0 17.1-5.2 20.6-13.8l8.3-20.1c13.2 1.7 26.8 2.6 40.6 2.6 8.5 0 16.8-0.4 25-1l7.6 18.5c3.5 8.6 11.9 13.8 20.6 13.8 2.8 0 5.7-0.5 8.5-1.7 11.4-4.7 16.8-17.7 12.1-29.1l-3.5-8.5c19.5-4.6 37.7-10.9 53.9-19l5.6 6.1c4.4 4.8 10.4 7.2 16.4 7.2 5.4 0 10.7-1.9 15-5.8 9.1-8.3 9.7-22.4 1.4-31.5l-0.9-1c5-4.4 9.6-9 13.6-13.9 7.9-9.4 6.6-23.5-2.8-31.4-9.2-7.9-23.2-6.6-31.1 2.8z"
            fill="#FFE255"
            p-id="1616"
          />
        </svg>
      </a>
      <a href="/" class="navbar-brand">干饭人点餐系统</a>
      <ul class="navbar-nav">
        <!-- <li><router-link :to="homeLink" class="nav-link">主页</router-link></li> -->
        <li><router-link :to="{name:'Home'}" class="nav-link">主页</router-link></li>
        <li><router-link :to="{name:'Menu'}" class="nav-link">菜单</router-link></li>
        <li><router-link :to="{name:'Admin'}" class="nav-link">管理</router-link></li>
        <li><router-link :to="{name:'About'}" class="nav-link">关于我们</router-link></li>
      </ul>

      <ul class="navbar-nav ml-auto" >
        <!-- 尚未登录时显示 -->
        <li><router-link :to="{name:'Login'}" v-show="!isLogin" class="nav-link">登录</router-link></li>
        <li><router-link :to="{name:'Register'}" v-show="!isLogin" class="nav-link">注册</router-link></li>

        <!-- 登录后显示 ,显示用户信息和退出按钮-->
        <li class="nav-link" v-show="isLogin">{{currentUser}}</li>
        <li @click="setLogin"><router-link :to="{name:'Login'}" v-show="isLogin" class="nav-link">[退出]</router-link></li>

      </ul>
    </nav>
  </header>
</template>
<script>
import axios from 'axios'
import userStatus from '../store/module/user-status'
export default {
  
  data() {
    return {
      homeLink:"/"
    }
  },
  computed:{
    currentUser(){
      return this.$store.getters.currentUser
    },
    //登录状态
    isLogin(){
      return this.$store.getters.isLogin

    }
  },
  methods:{
    setLogin(){
      // console.log("aaa");
      //非模块化
      // axios
      // .get(`/users/${this.$store.state.userId}`)
      // .then(res=>{
      //   console.log(res.data.id);
      //   axios
      //   .put(`/users/${res.data.id}`,{
      //       "userEmail": res.data.userEmail,
      //       "userPassword": res.data.userPassword,
      //       "isLogin": false,
      //   })
      // })
      //模块化
      //  console.log(userStatus.state.userId);
      axios
      .get(`/users/${userStatus.state.userId}`)
      .then(res=>{
        console.log(res.data.id);
        axios
        .put(`/users/${res.data.id}`,{
            "userEmail": res.data.userEmail,
            "userPassword": res.data.userPassword,
            "isLogin": false,
        })
      })
    },
  }
}
</script>